<template>
  <div class="login-page">
    <main class="content-wrapper">
      <div class="left">
        <img src="~@/assets/systhetic.jpg" alt="" />
      </div>
      <div class="right">
        <h3 class="project-name">数字乡村振兴运营平台</h3>
        <el-form
          :model="loginForm"
          :rules="rules"
          ref="form"
          size="large"
          @submit.native.prevent
        >
          <el-form-item prop="account">
            <el-input
              type="text"
              placeholder="用户名"
              name="username"
              auto-complete="off"
              v-model="loginForm.account"
            />
          </el-form-item>
          <el-form-item prop="pass">
            <el-input
              type="password"
              name="inputDom"
              placeholder="密码"
              auto-complete="new-password"
              v-model="loginForm.pass"
            />
          </el-form-item>
          <el-form-item class="smbot" prop="verifCode">
            <div class="form-row">
              <el-input
                placeholder="验证码"
                name="inputDom"
                v-model="loginForm.verifCode"
                style="flex: 1;"
              />
              <div class="verCodeImg">
                <!-- <img :src="imgUrl" /> -->
                <div class="svgbox" v-html="vcodeImg"></div>
                <span
                  @click="getImgCode"
                  style="margin-left: 20px; cursor: pointer;"
                >
                  换一张
                </span>
              </div>
            </div>
          </el-form-item>
          <div class="form-row">
            <el-checkbox v-model="rememberPasCbox" size="large">
              记住用户名和密码
            </el-checkbox>
            <el-button type="text" @click="dialogFormVisible = true">
              忘记密码
            </el-button>
          </div>
          <akButton />
          <el-button
            size="large"
            type="primary"
            style="width: 100%;margin-top: 20px;height: 50px;"
            @click="submitForm"
            :loading="loading"
            native-type="submit"
          >
            登 录
          </el-button>
        </el-form>
      </div>
      <FindPassword :visible.sync="dialogFormVisible" />
    </main>
  </div>
</template>

<script>
import FindPassword from './FindePassword'
import akButton from 'aehyok-hello'
// import { userLogin } from '@/services/user'
// import { getImgCode } from '@/services'

export default {
  components: {
    FindPassword,
  },
  data() {
    const validatePass = (rule, value, callback) => {
      if (value === '') {
        callback(new Error('请输入密码'))
      } else {
        if (this.loginForm.account !== '') {
          this.$refs.form.validateField('account')
        }
        callback()
      }
    }
    const validateAccount = (rule, value, callback) => {
      if (value === '') {
        callback(new Error('请输入用户名'))
      } else {
        callback()
      }
    }
    const validatorVerCode = (rule, value, callback) => {
      if (value === '') {
        callback(new Error('请输入验证码'))
      } else {
        callback()
      }
    }
    return {
      loginKey: '',
      vcodeImg: '',
      imgUrl: '',
      rememberPasCbox: false,
      loading: false,
      loginForm: {
        pass: '',
        account: '',
        verifCode: '',
      },
      dialogFormVisible: false,
      rules: {
        pass: [{ validator: validatePass, trigger: ['blur', 'change'] }],
        account: [{ validator: validateAccount, trigger: ['blur', 'change'] }],
        verifCode: [
          { validator: validatorVerCode, trigger: ['blur', 'change'] },
        ],
      },
    }
  },
  created() {
    this.checkRemPass()
    this.getImgCode()
  },
  methods: {
    // 判断是否已缓存账号密码
    checkRemPass() {
      const loginRemInfo = localStorage.getItem('loginRemInfo')
      if (loginRemInfo) {
        const jsonInof = JSON.parse(loginRemInfo)
        this.loginForm.account = jsonInof.account
        this.loginForm.pass = jsonInof.password
        this.rememberPasCbox = true
      }
    },
    // 判断是否需要记住账号密码
    checkNeedRemPass() {
      if (this.rememberPasCbox) {
        const info = {
          account: this.loginForm.account,
          password: this.loginForm.pass,
        }
        localStorage.setItem('loginRemInfo', JSON.stringify(info))
      } else {
        localStorage.removeItem('loginRemInfo')
      }
    },

    submitForm() {
      this.$refs.form.validate(valid => {
        if (valid) {
          this.checkNeedRemPass()
          this.adminLogin()
        }
      })
    },
    async getImgCode() {
      // const url = process.env.NODE_ENV === 'development' ? '/infra' : ''
      // this.imgUrl = `${url}/api/console/passport/verifycode?category=2&t=${new Date().getTime()}`
      const res = {
        code: 200,
        message: 'success',
        data: {
          key: '0335bf63-b5a0-463e-b378-125aba2c4de1',
          code:
            '<svg xmlns="http://www.w3.org/2000/svg" width="150" height="50" viewBox="0,0,150,50"><rect width="100%" height="100%" fill="#66CDAA"/><path fill="#2b302f" d="M89.15 41.20L88.97 41.02L89.09 41.14Q92.25 36.87 98.95 28.95L98.84 28.84L98.93 28.93Q93.00 29.13 89.23 27.76L89.17 27.70L89.22 27.76Q88.63 26.40 87.87 24.99L87.86 24.98L87.70 24.83Q91.98 26.52 96.44 26.56L96.26 26.39L96.45 26.57Q100.81 26.51 104.99 25.44L104.98 25.44L104.95 25.41Q104.54 26.05 104.27 26.59L104.42 26.74L104.25 26.57Q101.79 28.86 98.97 32.48L98.94 32.45L94.10 38.72L94.01 38.63Q96.34 38.53 98.59 38.61L98.48 38.50L98.50 38.52Q100.66 38.54 102.90 38.92L102.90 38.92L103.07 39.09Q103.14 39.62 103.87 41.64L103.88 41.65L103.94 41.71Q100.21 40.88 96.21 40.99L96.23 41.01L96.05 40.83Q92.25 41.10 88.60 42.28L88.51 42.20L88.56 42.25Q88.69 42.14 89.14 41.19ZM88.03 42.89L87.91 42.78L87.99 42.86Q88.69 42.45 90.29 42.03L90.27 42.01L90.37 42.12Q90.01 42.21 89.59 42.63L89.72 42.76L89.64 42.68Q89.44 43.27 88.83 44.42L88.75 44.34L88.87 44.46Q93.45 42.99 98.44 43.14L98.52 43.22L98.54 43.25Q103.40 43.31 107.97 45.17L108.12 45.32L108.03 45.24Q106.56 43.34 105.64 41.28L105.74 41.38L105.66 41.30Q104.98 41.08 103.91 40.85L103.91 40.84L103.91 40.84Q103.61 40.01 103.23 38.56L103.30 38.64L103.34 38.68Q101.71 38.26 98.13 38.15L98.12 38.14L98.11 38.13Q100.57 34.88 105.59 28.52L105.59 28.51L105.63 28.56Q105.90 27.84 106.59 26.51L106.50 26.42L104.31 27.28L104.15 27.12Q104.23 27.05 104.39 26.93L104.38 26.93L104.57 26.73L104.65 26.82Q105.16 25.80 105.73 24.85L105.61 24.73L105.71 24.83Q100.98 26.11 96.26 26.03L96.41 26.19L96.31 26.09Q91.53 26.03 87.04 24.20L87.03 24.20L87.03 24.19Q88.31 26.16 89.11 28.22L89.00 28.10L88.98 28.09Q89.87 28.44 90.93 28.70L90.94 28.71L90.84 28.62Q91.14 29.41 91.44 30.85L91.41 30.82L91.36 30.77Q92.97 31.05 96.28 31.20L96.28 31.19L96.31 31.23Q93.95 34.58 88.77 41.01L88.85 41.08L88.77 41.01Q88.58 41.65 88.01 42.87Z"/><path fill="#474d41" d="M72.63 40.04L72.73 40.13L70.56 40.25L70.64 40.34Q70.21 40.36 69.24 40.42L69.12 40.29L69.21 40.39Q68.25 40.45 67.75 40.45L67.77 40.47L67.77 40.47Q66.08 40.42 65.05 39.58L65.03 39.56L65.06 39.59Q65.91 38.54 67.55 36.40L67.44 36.30L67.54 36.40Q68.80 37.96 71.01 37.73L70.96 37.68L70.97 37.70Q71.89 37.58 72.54 36.94L72.54 36.94L72.55 36.95Q73.20 36.31 73.09 35.43L73.00 35.35L72.99 35.33Q72.97 30.83 73.05 26.26L72.97 26.17L73.05 26.25Q73.05 21.61 73.58 17.00L73.59 17.02L73.57 16.99Q75.59 16.88 77.72 15.85L77.61 15.74L77.62 15.76Q75.83 22.57 75.83 29.80L75.88 29.84L75.85 29.82Q75.74 33.25 76.19 36.75L76.33 36.89L76.25 36.81Q76.24 37.07 76.24 37.41L76.26 37.42L76.33 37.49Q76.39 38.13 76.16 38.66L76.10 38.59L76.13 38.63Q75.44 39.77 72.63 40.03ZM77.60 42.91L77.58 42.90L77.93 42.90L78.18 42.73L78.54 42.71L78.47 42.64Q78.89 42.49 78.97 42.38L78.84 42.25L78.90 42.31Q79.10 41.14 78.83 40.15L78.79 40.10L78.75 40.06Q77.49 34.36 77.76 28.00L77.73 27.97L77.67 27.91Q77.95 21.83 79.74 15.93L79.79 15.98L79.72 15.91Q78.93 16.64 77.67 17.37L77.66 17.36L77.59 17.29Q77.81 16.55 78.23 15.03L78.22 15.02L78.31 15.11Q75.66 16.31 73.00 16.61L73.07 16.69L73.05 16.67Q72.78 21.15 72.70 26.10L72.71 26.11L72.73 26.13Q72.60 31.97 72.67 35.40L72.57 35.29L72.75 35.47Q72.74 37.18 70.99 37.34L70.97 37.31L71.02 37.36Q69.16 37.33 67.48 35.69L67.66 35.87L67.51 35.71Q65.46 38.24 64.51 39.80L64.66 39.94L64.65 39.94Q65.28 40.57 66.31 40.80L66.16 40.64L66.17 40.66Q66.26 40.97 65.99 41.20L65.98 41.20L65.91 41.12Q67.25 41.97 69.23 42.24L69.35 42.35L69.36 42.37Q69.62 42.28 72.91 42.58L73.00 42.68L72.98 42.66Q76.24 42.92 77.61 42.92Z"/><path fill="#3c3938" d="M24.03 20.17L23.94 20.09L23.96 20.11Q19.71 20.16 16.02 19.17L15.93 19.08L15.91 19.06Q17.43 23.63 17.62 28.46L17.71 28.55L17.69 28.53Q17.77 33.22 16.55 37.82L16.63 37.90L16.71 37.98Q19.48 37.33 22.99 37.18L22.95 37.14L22.96 37.15Q26.81 36.89 28.60 34.45L28.63 34.48L28.72 34.58Q30.15 32.42 30.34 28.31L30.47 28.45L30.32 28.29Q30.45 26.59 29.99 24.88L29.96 24.85L29.93 24.82Q28.75 20.17 24.03 20.17ZM12.12 42.19L12.04 42.11L12.11 42.18Q14.95 36.45 14.95 29.75L14.99 29.79L15.00 29.80Q14.91 21.18 10.61 14.17L10.73 14.30L10.75 14.32Q15.90 16.88 24.16 17.07L24.27 17.17L24.12 17.03Q33.02 17.25 33.36 24.40L33.31 24.36L33.46 24.51Q33.59 27.22 33.55 28.67L33.47 28.59L33.56 28.67Q33.43 33.31 32.59 35.48L32.64 35.52L32.60 35.49Q32.18 36.59 31.42 37.42L31.34 37.35L31.45 37.46Q30.09 38.99 27.47 39.49L27.46 39.48L27.28 39.31Q25.77 39.66 22.76 39.89L22.81 39.94L22.87 39.99Q16.61 40.32 12.00 42.07ZM30.02 42.04L29.93 41.95L30.06 42.08Q32.83 41.77 34.47 40.29L34.42 40.24L34.34 40.15Q35.55 38.39 35.51 35.65L35.56 35.71L35.43 35.57Q35.50 34.28 35.35 30.77L35.32 30.74L35.11 26.34L34.94 26.17Q34.76 23.90 33.81 21.81L33.86 21.85L33.92 21.91Q33.29 20.87 32.60 20.22L32.80 20.41L32.70 20.17L32.75 20.22Q30.90 17.11 26.49 16.73L26.66 16.90L26.51 16.75Q23.78 16.57 16.77 15.85L16.85 15.93L16.95 16.02Q13.63 15.52 9.93 13.50L9.84 13.41L9.96 13.53Q14.74 20.86 14.74 29.61L14.65 29.52L14.64 29.51Q14.65 36.53 11.30 42.70L11.44 42.84L11.39 42.79Q12.01 42.46 13.35 41.96L13.48 42.10L13.32 41.94Q12.98 42.78 12.10 44.26L12.28 44.44L12.13 44.29Q15.21 43.25 18.56 42.76L18.59 42.79L18.66 42.86Q20.72 42.53 24.38 42.41L24.25 42.29L24.35 42.38Q28.13 42.17 29.96 41.98ZM30.05 28.41L30.05 28.40L30.03 28.38Q29.65 36.38 22.95 36.76L22.96 36.77L22.89 36.70Q20.99 36.85 18.93 37.12L18.90 37.09L18.95 37.14Q19.73 33.35 19.73 29.70L19.75 29.71L19.66 29.62Q19.68 25.95 18.96 22.11L18.85 22.00L18.99 22.14Q21.26 22.51 25.94 22.51L25.85 22.42L25.86 22.42Q27.23 22.27 28.87 23.22L28.89 23.24L28.80 23.16Q30.22 25.56 30.06 28.42Z"/><path fill="#252b31" d="M45.57 28.58L45.53 28.54L45.61 28.62Q42.75 28.58 41.98 30.82L41.97 30.80L42.10 30.93Q41.79 31.58 41.68 32.23L41.63 32.18L41.72 32.27Q44.27 32.42 45.91 32.42L46.00 32.51L45.86 32.38Q47.59 32.47 50.18 32.36L50.10 32.27L50.26 32.44Q50.14 30.72 48.74 29.66L48.67 29.59L48.62 29.54Q47.36 28.59 45.57 28.59ZM45.67 41.17L45.66 41.16L45.66 41.16Q41.40 41.13 40.11 39.72L40.21 39.82L40.13 39.74Q39.12 38.23 38.96 34.96L39.13 35.13L39.05 35.04Q39.09 34.86 39.01 33.49L39.07 33.54L39.00 33.48Q38.92 31.22 38.92 30.50L38.81 30.39L38.84 30.42Q38.79 28.51 39.51 27.40L39.52 27.41L39.49 27.38Q40.90 25.97 43.87 25.97L43.85 25.95L45.50 26.04L45.51 26.05Q47.60 26.08 49.12 26.39L48.99 26.26L48.99 26.25Q51.09 26.76 52.08 27.98L52.03 27.93L52.15 28.04Q52.76 29.11 52.83 31.20L52.89 31.26L52.87 31.24Q52.76 32.27 52.80 34.44L52.91 34.55L52.74 34.38Q49.96 34.49 47.18 34.49L47.20 34.52L41.69 34.60L41.53 34.44Q41.82 38.99 45.89 38.77L45.80 38.67L45.86 38.74Q49.62 38.54 50.84 36.71L50.76 36.63L50.84 36.71Q51.77 37.29 53.36 38.47L53.38 38.48L53.21 38.32Q51.87 40.74 47.72 41.01L47.73 41.02L47.70 40.99Q47.06 41.11 45.69 41.19ZM47.91 43.45L48.01 43.55L48.09 43.63Q48.97 43.37 50.19 43.45L50.22 43.47L50.27 43.52Q55.31 43.77 56.22 40.99L56.17 40.93L56.24 41.00Q54.52 39.67 53.42 38.91L53.51 39.00L53.43 38.92Q53.54 38.46 53.73 38.23L53.83 38.33L53.86 38.36Q53.01 37.77 51.64 36.82L51.76 36.94L51.65 36.84Q52.87 37.03 54.93 37.34L54.89 37.29L54.80 37.20Q54.64 35.86 54.56 35.18L54.55 35.17L54.57 33.40L54.51 33.33Q54.39 31.01 53.74 29.52L53.57 29.35L53.65 29.43Q53.49 29.20 52.92 28.59L52.83 28.49L52.87 28.54Q52.60 28.12 52.37 27.54L52.41 27.58L52.41 27.58Q50.56 25.58 45.50 25.58L45.51 25.60L43.78 25.54L43.80 25.56Q40.57 25.57 39.12 27.05L39.18 27.11L39.14 27.06Q38.37 28.08 38.41 30.14L38.51 30.24L38.53 30.26Q38.56 31.20 38.67 33.45L38.71 33.49L38.69 33.47Q38.80 35.10 38.92 37.16L38.93 37.17L38.86 37.10Q39.16 39.38 40.03 40.45L40.06 40.47L39.92 40.33Q40.19 40.60 40.38 40.71L40.42 40.76L40.71 41.38L40.60 41.28Q41.48 43.23 48.07 43.61ZM45.93 38.39L45.81 38.27L45.80 38.26Q44.70 38.41 43.79 37.95L43.82 37.99L43.76 37.93Q43.76 37.59 43.57 36.90L43.62 36.95L43.45 36.78Q45.30 36.84 46.90 36.84L46.77 36.71L46.81 36.75Q48.57 36.84 50.24 36.95L50.17 36.87L50.12 36.82Q48.90 38.24 45.90 38.35ZM47.55 31.02L47.60 31.07L47.45 30.92Q48.13 30.99 49.46 31.37L49.45 31.36L49.58 31.68L49.74 32.03L49.60 31.89Q48.32 32.10 47.41 32.06L47.46 32.11L47.44 32.09Q45.04 31.94 45.00 31.94L44.98 31.92L45.17 32.10Q45.87 31.13 47.55 31.02Z"/><path d="M4 34 C55 13,63 30,136 6" stroke="#a6e990" fill="none"/><path d="M8 48 C79 7,89 24,138 17" stroke="#b27ce8" fill="none"/><path fill="#484855" d="M129.86 41.63L129.69 41.46L129.79 41.56Q127.70 41.19 125.53 41.04L125.43 40.94L125.52 41.02Q124.03 39.54 121.37 35.69L121.37 35.70L121.44 35.77Q119.15 38.77 116.75 41.20L116.88 41.33L114.78 41.71L114.80 41.72Q113.65 41.83 112.66 42.10L112.71 42.15L112.70 42.14Q116.93 38.07 119.94 33.96L119.91 33.93L119.76 33.79Q116.59 29.69 111.18 24.90L111.07 24.79L111.16 24.87Q113.33 25.57 116.04 25.98L116.08 26.02L116.03 25.98Q119.49 29.10 121.40 31.80L121.47 31.88L121.54 31.94Q123.57 28.80 126.31 26.28L126.42 26.39L126.36 26.33Q129.31 25.89 131.13 25.40L131.18 25.44L131.11 25.38Q126.60 29.04 122.91 33.61L122.92 33.63L122.88 33.58Q126.24 38.24 129.70 41.48ZM132.68 24.73L132.58 24.64L132.67 24.73Q129.82 25.60 126.28 25.94L126.13 25.79L126.27 25.94Q123.25 28.48 121.54 30.95L121.66 31.07L121.61 31.03Q120.78 30.04 119.14 28.06L119.10 28.02L118.86 27.97L118.84 27.94Q118.78 28.00 118.67 28.00L118.57 27.91L118.72 28.05Q117.94 27.20 116.30 25.75L116.24 25.69L116.18 25.63Q112.75 25.24 109.89 24.03L109.83 23.97L109.76 23.89Q115.31 28.72 119.34 33.86L119.32 33.84L119.27 33.79Q116.07 38.58 111.66 42.88L111.58 42.81L111.64 42.86Q111.76 42.64 115.26 41.81L115.35 41.90L115.41 41.96Q113.71 43.11 112.07 44.44L112.25 44.62L112.13 44.50Q115.36 43.62 118.52 43.43L118.44 43.35L118.54 43.45Q120.85 41.11 122.75 38.37L122.86 38.48L122.78 38.40Q124.26 40.22 125.48 41.40L125.38 41.30L125.54 41.46Q125.61 41.42 125.69 41.50L125.55 41.36L125.83 41.45L125.84 41.46Q127.07 42.54 128.41 43.61L128.49 43.69L128.50 43.70Q132.02 44.18 134.91 45.20L134.86 45.15L134.90 45.19Q128.75 40.75 125.06 35.57L125.08 35.60L125.05 35.57Q128.63 30.47 133.20 26.40L133.26 26.46L133.25 26.45Q132.20 26.69 131.21 26.92L131.39 27.10L129.21 27.40L129.27 27.46Q130.40 26.49 132.57 24.62Z"/><path d="M3 17 C88 32,89 19,146 4" stroke="#c476df" fill="none"/><path d="M21 19 C57 34,87 35,137 11" stroke="#66ea66" fill="none"/></svg>',
        },
      }
      // await getImgCode()
      if (res.code === 200) {
        this.loginKey = res.data.key
        this.vcodeImg = res.data.code
      }
      console.log(res)
    },

    async adminLogin() {
      this.loading = true
      // const res = await userLogin({
      //   account: this.loginForm.account,
      //   code: this.loginForm.verifCode,
      //   password: this.loginForm.pass,
      //   key: this.loginKey,
      // })
      const res = {
        code: 200,
        message: 'success',
        data: {
          token: 'rlvlr4pudverbo1u.5f4764245cbf7500136db76b.1612495697920',
          userId: '5f4764245cbf7500136db76b',
          account: 'admin',
          realName: '超级管理员',
          status: 1,
          orgId: '5f4764225cbf7500136db76a',
        },
      }
      console.log(res, 'this.login')
      this.loading = false

      if (res?.code === 200) {
        localStorage.setItem('loginInfo', JSON.stringify(res.data))
        window.location.reload()
      } else {
        this.getImgCode()
      }
    },
  },
}
</script>

<style lang="scss" scoped>
.login-page {
  height: 100vh;
  background: url('~@/assets/bg.jpg');

  ::v-deep .el-input {
    font-size: 16px;
  }

  ::v-deep .el-input__inner {
    height: 50px;
  }
}

.project-name {
  text-align: center;
  font-size: 44px;
  font-weight: 600;
  color: #099e45;
  margin-bottom: 90px;
}

.content-wrapper {
  display: flex;
  background: #fff;
  position: absolute;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  width: 88%;
  height: 794px;
  box-shadow: 0 2px 12px 0 rgba(0, 0, 0, 0.1);
  .left {
    flex: 0 0 56.5%;

    > img {
      width: 100%;
      height: 100%;
      object-fit: cover;
    }
  }

  .right {
    flex: 1;
    padding: 7% 7% 0;
  }
}

.verCodeImg {
  margin-left: 10px;
  display: flex;
  align-items: center;
  .svgbox {
    position: relative;
    top: 6px;
  }
  img {
    height: 100%;
  }
}
.form-row {
  display: flex;
  justify-content: space-between;
  align-items: center;
  font-size: 14px;
}
</style>
